# Tap
tap "oven-sh/bun"

# Cask
cask "1password-cli"
cask "1password"
cask "brave-browser"
cask "chatgpt"
cask "claude-code"
cask "cursor"
cask "dbeaver-community"
cask "ghostty"
cask "google-drive"
cask "helium-browser"
cask "hiddenbar"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "monitorcontrol"
cask "notion"
cask "obsidian"
cask "opencode-desktop"
cask "postman"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "temurin"
cask "vivaldi"
cask "whatsapp"
cask "zed"

# Formulae
brew "bat"
brew "coursier"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "dotbot"
brew "eza"
brew "fnm"
brew "fzf"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "go"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "neovim"
brew "opencode"
brew "oven-sh/bun/bun"
brew "pandoc"
brew "tmux"
brew "watchman"

# App Store
mas "Developer", id: 640199958
mas "Ethernet Status", id: 1186187538
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835

# Fonts
cask "font-monaspace"

# VSCode Extensions
vscode "aaron-bond.better-comments"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "biomejs.biome"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "yoavbls.pretty-ts-errors"
