# Cask
cask "1password"
cask "brave-browser"
cask "chatgpt"
cask "cursor"
cask "ghostty"
cask "google-drive"
cask "hiddenbar"
cask "microsoft-outlook"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "monitorcontrol"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "raycast"
cask "rectangle"

# Formulae
brew "bat"
brew "dotbot"
brew "eza"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "neovim"
brew "tmux"

# App Store
mas "Amphetamine", id: 937984704
mas "Developer", id: 640199958

# Fonts
cask "font-monaspace"

# VSCode Extensions
vscode "aaron-bond.better-comments"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "kevinrose.vsc-python-indent"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-xml"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
