# Cask
cask "orbstack"
cask "raycast"
cask "ghostty"
cask "cursor"
cask "obsidian"
cask "notion"
cask "notion-calendar"

# Formulae
brew "yq"
brew "stow"
brew "git"
brew "lazygit"
brew "git-delta"
brew "neovim"
brew "eza"
brew "bat"
brew "fzf"
brew "tmux"

# Fonts
cask "font-monaspace"
cask "font-monaspace-nerd-font"